KanatERPSukhova.КанатАдаптация/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bf75bcc5-82ee-4bd0-89e1-420b42c99454">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_ВИПКлиент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ИспользоватьГрупповыеУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_КодСбыта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Отрасль</name>
    <type>
      <types>CatalogRef.КАНАТ_Отрасль</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ФормаОрганизации</name>
    <type>
      <types>CatalogRef.КАНАТ_ФормаОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ГруппировкаДляОтчета</name>
    <type>
      <types>CatalogRef.КАНАТ_ГруппировкаДляОтчета</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="0daacbf9-aa02-4485-a535-d2d28b00523c">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Catalogs/Партнеры/Forms/ФормаЭлементаРеквизитыКонтрагента/Module.bsl
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ Гурьев 28.09.23 ЧТЗ_2_11_4
	
	//Добавление на форму флажка ВИП-Клиент
	ПолеВыводитьСкидки = Элементы.Добавить("КАНАТ_ПолеВИПКлиент",
											Тип("ПолеФормы"),
											Элементы.ГруппаНаименование); 
	ПолеВыводитьСкидки.Заголовок = "ВИП-Клиент"; 
	ПолеВыводитьСкидки.ПутьКДанным = "Объект.КАНАТ_ВИПКлиент";
	ПолеВыводитьСкидки.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеВыводитьСкидки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	Элементы.Переместить(ПолеВыводитьСкидки, Элементы.ГруппаНаименование, Элементы.ГруппаНаименования);
	
	//-- Гурьев 28.09.23 ЧТЗ_2_11_4
	
	//БИТ_Гурьев_ЧТЗ_2_16_16.05.24++
	ПолеИспользоватьГрупповыеУпаковки = Элементы.Добавить("КАНАТ_ИспользоватьГрупповыеУпаковки",
											Тип("ПолеФормы"),
											Элементы.ГруппаНаименование); 
	ПолеИспользоватьГрупповыеУпаковки.Заголовок = "Использовать групповые упаковки"; 
	ПолеИспользоватьГрупповыеУпаковки.ПутьКДанным = "Объект.КАНАТ_ИспользоватьГрупповыеУпаковки";
	ПолеИспользоватьГрупповыеУпаковки.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеИспользоватьГрупповыеУпаковки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	Элементы.Переместить(ПолеИспользоватьГрупповыеУпаковки, Элементы.ГруппаНаименование, Элементы.ГруппаНаименования);
	//++Бит Трейгер П.М. Добавить реквизиты к справочнику контрагенты
	НовыйЭлемент = Элементы.Добавить("КАНАТ_КодСбыта",
											Тип("ПолеФормы"),
											Элементы.ГруппаДополнительныеРеквизиты); 
	НовыйЭлемент.Заголовок = "Код сбыта"; 
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_КодСбыта";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	
	
	НовыйЭлемент = Элементы.Добавить("КАНАТ_Отрасль",
											Тип("ПолеФормы"),
											Элементы.ГруппаДополнительныеРеквизиты); 
	НовыйЭлемент.Заголовок = "Отрасль"; 
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_Отрасль";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;

		НовыйЭлемент = Элементы.Добавить("КАНАТ_ФормаОрганизации",
											Тип("ПолеФормы"),
											Элементы.ГруппаДополнительныеРеквизиты); 
	НовыйЭлемент.Заголовок = "Форма Организации"; 
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_ФормаОрганизации";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;

			НовыйЭлемент = Элементы.Добавить("КАНАТ_ГруппировкаДляОтчета",
											Тип("ПолеФормы"),
											Элементы.ГруппаДополнительныеРеквизиты); 
	НовыйЭлемент.Заголовок = "Группировка для отчета"; 
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_ГруппировкаДляОтчета";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;

	
	//--Бит Трейгер П.М. Добавить реквизиты к справочнику контрагенты
	Элементы.ДополнительнаяИнформация.АвтоМаксимальнаяВысота = Ложь;
	Элементы.ДополнительнаяИнформация.МаксимальнаяВысота = 10;
	//БИТ_Гурьев_ЧТЗ_2_16_16.05.24--
	
КонецПроцедуры
